export default function InfoStickers() {
  return (
    <section className="pb-4">
      <h3 className="font-bold">Цифровий стікер Auto Help</h3>
      <p className="mb-4">
        Це стильний цифровий стікер із нашим логотипом — створений спеціально
        для твого особистого використання.
      </p>
      <h3 className="font-bold">
        Він доступний у форматі PNG або JPG з крутою якістю, тож ти легко зможеш
        використати його:
      </h3>
      <ul className="">
        <li>— у своїх соцмережах (Instagram, Telegram, Facebook тощо);</li>
        <li>
          — для створення креативного контенту: сторіс, постів, банерів — що
          завгодно;
        </li>
        <li>— щоб прикрасити свої проєкти чи презентації;</li>
        <li>— або будь-де, де хочеться додати щось яскраве й унікальне.</li>
      </ul>
      <h3 className="font-bold">
        Стікер — це не просто картинка, це твій настрій у цифровому світі!
      </h3>
    </section>
  );
}
